package christmas;

public class Application {
    public static void main(String[] args) {
        new Controller().run();
    }

    /*
    *  12월 1일부터 1000원으로 시작 하루가 지날때마다 100원씩 추가 할인
    *  총주문 금액에서 해당 금액만큼 할인
    *  일요일 ~ 목요일 : 디저트 메뉴 1개당 2,023원 할인
    *  금, 토요일 : 메인 메뉴 1개당 2,023원 할인
    *  이벤트 달력에 별이 있으면 총주문 금액에서 1,000원 할인
    *  할인 전 총 주문 금액이 12만원이면 삼페인 1개 증정
    *  총혜택 금액에 따라 5천원 이상 : 별, 1만원 이상 : 트리, 2만원 이상 산타 배지 부여
    *  총 주문 금액 10,000원 이상부터 이벤트 적용
    *  음료만 주문 시 적용 x
    *  1번에 메뉴 20개까지만 주문 가능
    *
    * */
}
